Revit 2027 API
ConnectorManager.Connectors Property
Return all the Connectors of the Connector Manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorSet Connectors { get; }
Public ReadOnly Property Connectors As ConnectorSet
	Get
public:
property ConnectorSet^ Connectors {
	ConnectorSet^ get ();
}
member Connectors : ConnectorSet with get
Property Value
ConnectorSet
Remarks
This property is used to retrieve the Connectors from the Connector Manager.
See Also
Reference
ConnectorManager Class
Autodesk.Revit.DB Namespace